In [11]:
import numpy as np
import pandas as pd

In [12]:
df = pd.read_csv(
    "C:\\Coding\\python-projects\\ml-jose-portilla\\jose\\03-Pandas\\example.csv",
   index_col="a"
)
df

     b   c   d
a
0    1   2   3
4    5   6   7
8    9  10  11
12  13  14  15

In [13]:
df.to_clipboard()

In [14]:
df.to_csv("example1.csv")

In [15]:
tables = pd.read_html(
    "https://en.wikipedia.org/wiki/World_population"
)

table_year_population = tables[12]
table_year_population = table_year_population[:]
table_year_population.columns

Index(['Year', 'Population', '%', 'Number', 'Density (pop/km2)'], dtype='object')

In [16]:
table_year_population.to_html("sampletable.html")

In [17]:
excel_file = pd.read_excel(
    "C:\\Coding\\python-projects\\ml-jose-portilla\\jose\\03-Pandas\\my_excel_file.xlsx",
    sheet_name=None
)
type(excel_file)

df_first = excel_file["First_Sheet"]
df_first

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [18]:
df_first.to_excel("example.xlsx",sheet_name="First_Sheet",index=False)

In [19]:
from sqlalchemy import create_engine

temp_db = create_engine("sqlite:///:memory:")

In [22]:
df = pd.DataFrame(data=np.random.randint(low=1,high=100,size=(4,4)),columns=["a","b","c","d"])
df

    a   b   c   d
0  66  11  87  81
1  57  96  70  41
2  92  90  52  93
3  40  50  20  24

In [25]:
df.to_sql(name="new_table",if_exists="replace",con=temp_db)

4

In [28]:
df = pd.read_sql(sql="new_table",con=temp_db)

In [31]:
pd.read_sql_query(sql="select b,c from new_table",con=temp_db)

    b   c
0  11  87
1  96  70
2  90  52
3  50  20

In [30]:
df.drop(columns=["index"])

    a   b   c   d
0  66  11  87  81
1  57  96  70  41
2  92  90  52  93
3  40  50  20  24